-- phpMyAdmin SQL Dump
-- version 4.4.15.10
-- https://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Nov 01, 2019 at 01:30 AM
-- Server version: 5.5.64-MariaDB
-- PHP Version: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `db_adviser`
--

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE IF NOT EXISTS `migrations` (
  `id` int(10) unsigned NOT NULL,
  `migration` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_07_08_143317_create_tbl_lecturers_table', 1),
(4, '2019_07_08_145123_add_academic_colunm_to_tbl_lecturers_table', 2),
(5, '2019_07_10_152832_add_image_column_to_tbl_lecturers_table', 3),
(6, '2019_07_15_110317_create_students_table', 4),
(7, '2019_07_23_095724_add_column_to_students_table', 5),
(8, '2019_07_23_100907_add_lec_id_column_to_students_table', 6),
(9, '2019_07_23_113707_add_project_column_to_students_table', 7),
(10, '2019_07_30_095639_add_column_to_students_table', 8);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE IF NOT EXISTS `password_resets` (
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE IF NOT EXISTS `students` (
  `id` int(10) unsigned NOT NULL,
  `student_id` varchar(13) COLLATE utf8mb4_unicode_ci NOT NULL,
  `lec_id` char(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `std_title` char(10) COLLATE utf8mb4_unicode_ci DEFAULT 'NULL',
  `std_fname` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `std_lname` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `facultyname` char(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `programname` char(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `academic_year` year(4) NOT NULL,
  `semester` int(11) NOT NULL DEFAULT '1',
  `project` int(1) NOT NULL,
  `title_research` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=48 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`id`, `student_id`, `lec_id`, `std_title`, `std_fname`, `std_lname`, `facultyname`, `programname`, `academic_year`, `semester`, `project`, `title_research`, `status`, `created_at`, `updated_at`) VALUES
(4, '1412353010', '00881102', 'นางสาว', 'พิกุล', 'ประคองกิจ', 'บัณฑิตวิทยาลัย', 'ระบบสารสนเทศทางการบัญชี', 2018, 1, 1, '', 1, '2019-07-23 10:21:11', '2019-07-25 03:45:02'),
(5, '1412353011', '00771101', 'นาย', 'สุรเสกข์', 'เจริญนิธิพัทธ์', 'บัณฑิตวิทยาลัย', 'ระบบสารสนเทศทางการบัญชี', 2019, 1, 2, '', 1, '2019-07-24 03:37:45', '2019-07-24 03:38:13'),
(6, '1412353009', '00881102', 'นางสาว', 'ชัญญาภัค', 'ฮั่นตระกูล', 'บัณฑิตวิทยาลัย', 'ระบบสารสนเทศทางการบัญชี', 2019, 1, 1, '', 1, '2019-07-24 03:41:20', '2019-07-24 03:41:20'),
(7, '1412353008', '00771101', 'นางสาว', 'ปัณฑ์ชนิต', 'จารุวงศ์กุล', 'บัณฑิตวิทยาลัย', 'ระบบสารสนเทศทางการบัญชี', 2019, 1, 1, '', 1, '2019-07-24 03:43:17', '2019-07-24 03:43:17'),
(8, '1412353007', '25581036', 'นางสาว', 'ศิริเนตร', 'ดีประเสริฐ', 'บัณฑิตวิทยาลัย', 'ระบบสารสนเทศทางการบัญชี', 2019, 1, 2, 'ทดสอบหัวข้องานวิจัย2', 1, '2019-07-30 08:41:52', '2019-07-30 08:44:54'),
(11, '1810331301025', '02231103', 'นางสาว', 'วราภรณ์', 'กนกธีรพันธุ์', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2019, 0, 2, 'การศึกษาผลกระทบการปิดเจรจาการค้าไทย- ศรีลังกา ที่มีต่อเศรษฐกิจไทย', 1, '2019-09-24 07:11:57', '2019-09-24 07:11:57'),
(12, '1720331301002', '03201103', 'นางสาว', 'นันท์นภัส', 'คล้ายคลึง', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2018, 2, 2, 'ปัจจัยที่ส่งผลกระทบต่อปริมาณการส่งออกลำไยสดไปประเทศจีน', 1, '2019-09-24 07:13:30', '2019-09-24 07:13:30'),
(13, '1810331301026', '02231103', 'นางสาว', 'พิมพ์วิภา', 'ศุภชัยบัวทอง', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2018, 2, 2, 'ปัจจัยที่ส่งผลต่อดัชนีราคาหลักทรัพย์ set50', 1, '2019-09-24 07:15:03', '2019-09-24 07:15:03'),
(14, '1720331301001', '03201103', 'นาย', 'จีรายุทธ', 'คำสวาสดิ์', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2018, 2, 2, 'การศึกษาปัจจัยที่ส่งผลกระทบต่ออัตราดอกเบี้ยเงินกู้ลูกค้ารายใหญ่ชั้นดี (MLR) ของ ธนาคารพานิชย์ประเทศไทย กรณีศึกษา ธนาคารกสิกรไทย จำกัด (มหาชน)', 1, '2019-09-24 07:25:14', '2019-09-24 07:25:14'),
(15, '1810331301027', '18471103', 'นาย', 'ทักษ์ดนัย', 'วัชรสินธุ', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2018, 2, 2, 'การศึกษาปัจจัยทางเศรษฐกิจที่มีผลต่อดัชนีราคาหลักทรัพย์กลุ่มอุตสาหกรรมอสังหาริมทรัพย์และก่อสร้างในประเทศไทย', 1, '2019-09-24 07:27:42', '2019-09-24 07:27:42'),
(16, '1810331301029', '10551103', 'นาย', 'ภัทรวุฒิ', 'สูงกิจบูลย์', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2018, 2, 2, 'ปัจจัยที่มีผลกระทบต่อการลงทุนโดยตรงจากต่างประเทศในประเทศไทย', 1, '2019-09-24 07:32:03', '2019-09-24 07:32:03'),
(17, '1810331301030', '10551103', 'นางสาว', 'มุทิตา', 'มะกล่ำทอง', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2018, 2, 2, 'ความสัมพันธ์ระหว่างทรัพยากรมนุษย์กับการเจริญเติบโตทางเศรษฐกิจ', 1, '2019-09-24 07:33:06', '2019-09-24 07:33:06'),
(18, '1810331301031', '18471103', 'นางสาว', 'ณัฐิดา', 'จัดวงศ์', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2018, 2, 2, 'ปัจจัยทางเศรษฐกิจที่มีความสัมพันธ์ต่ออัตราแลกเปลี่ยนค่าเงินหยวนต่อค่าเงินดอลล่่าร์สหรัฐฯ', 1, '2019-09-24 07:34:32', '2019-09-24 07:34:32'),
(19, '1810331301032', '03201103', 'นางสาว', 'พัชราภรณ์', 'นิยมจิตร', 'บัณฑิตวิทยาลัย', 'เศรษฐศาสตร์ธุรกิจ', 2018, 2, 0, 'ปัจจัยที่เป็นตัวกำหนด CPI ในประเทศไทย', 1, '2019-09-24 07:42:19', '2019-09-24 07:42:19'),
(20, '1710831301002', '20441108', 'นางสาว', 'ฐานิตา', 'ราชกวี', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2018, 2, 2, 'บทบาทและความรับผิดของเลขานุการบริษัทในบริษัทจดทะเบียนไทย\r\n/การประชุมนำเสนอผลงานวิจัยบัณฑิตศึกษาแห่งชาติ ครั้งที่ 14 ปีการศึกษา 2562 บัณฑิตวิทยาลัย ม.หอการค้าไทย ในวันที 2 สิงหาคม 2562', 1, '2019-09-24 08:12:56', '2019-09-24 09:26:46'),
(21, '1710831301008', '19591108', 'นางสาว', 'มุกมณี', 'มุตต๊ะ', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2018, 2, 2, 'การจัดเก็บภาษีเพื่อวัตถุประสงค์เฉพาะกับความสอดคล้องทางวินัยการเงินการคลัง/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษาระดับชาติ ครั้งที่ 14 ปีการศึกษา 2562 ในวันที 2 สิงหาคม 2562', 1, '2019-09-24 09:30:18', '2019-09-24 09:32:24'),
(22, '1710831301010', '20451108', 'Mrs.', 'Thipsavanh', 'Phothisen', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2018, 2, 2, 'การศึกษาเปรียบเทียบแนวทางการออกใบอนุญาตประกอบธุรกิจสถาบันการเงินที่ไม่ใช่ธนาคาร กรณีศึกษาเฉพาะธุรกิจการให้สินเชื่อรายย่อยเพื่อประกอบอาชีพภายใต้การกำกับในสาธารณรัฐประชาธิปไตย ประชาชนลาว และประเทศไทย/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษาระดับชาติ ครั้งที่ 14 ปีการศึกษา 2562 ในวันที 2 สิงหาคม 2562', 1, '2019-09-24 09:31:28', '2019-09-24 09:31:28'),
(23, '1710831301011', '19591108', 'Mrs.', 'Sonemaly', 'Taipangnavong', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2018, 2, 2, 'กรณีศึกษาเปรียบเทียบมาตรการส่งเสริมวิสาหกิจขนาดกลางและขนาดย่อมในการเข้าถึงแหล่งเงินทุนในระบบธนาคารของธนาคารแห่ง สาธารณัฐประชาธิปไตยประชาชนลาว และ ธนาคารแห่งประเทศไทย/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษาระดับชาติ ครั้งที่ 14 ปีการศึกษา 2562 ในวันที 2 สิงหาคม 2562', 1, '2019-09-24 09:33:32', '2019-09-24 09:33:32'),
(24, '1710831301012', '20451108', 'Mr.', 'Latsadanay', 'Sengmany', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2018, 2, 2, 'การศึกษาเปรียบเทียบมาตรการคุ้มครองเงินรับล่วงหน้าจากผู้ใช้บริการระบบชำระเงินของประเทศไทยและประเทศลาว กรณีศึกษาผู้ให้บริการการชำระเงินตกเป็นบุคคลล้มละลาย/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษาระดับชาติ ครั้งที่ 14 ปีการศึกษา 2562 ในวันที 2 สิงหาคม 2566', 1, '2019-09-24 09:35:54', '2019-09-24 09:35:54'),
(26, '1710831301005', '19051108', 'นาย', 'เอกณัท', 'สุชาติพันธุ์', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2018, 2, 2, 'การคุ้มครองข้อมูลส่วนบุคคล: ศึกษากรณีการโอนข้อมูลข้ามพรมเเดนของธุรกิจธนาคาร/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษาระดับชาติ ครั้งที่ 14 ปีการศึกษา 2562 ในวันที 2 สิงหาคม 2562', 1, '2019-09-24 09:38:51', '2019-09-24 09:38:51'),
(27, '1710831301007', '19051108', 'นางสาว', 'ณัฐสุดา', 'จารุพูนผล', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2018, 2, 0, 'ปัญหาทางกฎหมายเรื่องความเสียหายจากการรุกล้ำความเป็นส่วนตัวขอเฟชบุ๊กศึกษาเปรียบเทียบแนวคิดสหภาพยุโรปและประเทศไทย/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษาระดับชาติ ครั้งที่ 14 ปีการศึกษา 2562 ในวันที 2 สิงหาคม 2562', 1, '2019-09-24 09:40:12', '2019-09-24 09:40:12'),
(28, '1612433008', '19591108', 'นางสาว', 'ปุญณิศา', 'เนติกฤษฎา', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2017, 2, 0, 'ปัญหาองค์กรที่มีอำนาจกำหนดค่าทดแทนอสังหาริมทรัพย์ กรณีศึกษาเปรียบเทียบประเทศไทยกับประเทศอังกฤษ/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษาระดับชาติ ครั้งที่ 13 ปีการศึกษา 2561 ในวันที 16 สิงหาคม 2561', 2, '2019-09-24 09:42:16', '2019-09-24 09:42:16'),
(29, '1512433002', '19051108', 'นาย', 'วรวิทย์', 'อัมวงษ์', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2017, 2, 2, 'การศึกษาปัญหาความสงบเรียบร้อยและศีลธรรมอันดีของประชาชนที่มีผลต่อการเพิกถอนคำชี้ขาดของอนุญาโตตุลาการระหว่างประเทศ/นำเสนอผลงานวิจัยทีมหาวิทยาลัยรามคำแหง', 2, '2019-09-24 09:43:45', '2019-09-24 09:43:45'),
(30, '1412063022', '12731101', 'นางสาว', 'นิลเนตร', 'แก้วโรจน์', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชาการตลาด', 2018, 2, 1, 'ศึกษาความสัมพันธ์ระหว่างการรับรู้ถึงความง่าย การรับรู้ถึงประโยชน์ ทัศนคติในการซื้อ การบอกต่อและความไว้วางใจต่อความตั้งใจซื้อประกันภัยผ่านระบบออนไลน์', 1, '2019-09-25 04:13:36', '2019-09-25 04:13:36'),
(31, '1522433001', '19591108', 'นาย', 'ทวีชัย', 'มีลาภ', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2016, 2, 2, 'กรณีศึกษาเปรียบเทียบการประเมินภาษีและการบริหารการจัดเก็บภาษีที่ดินและสิ่งปลูกสร้างของประเทศไทยกับการประเมินภาษีและการบริหารการจัดเก็บภาษีทรัพย์สิน (อสังหาริมทรัพย์) ของมลรัฐนิวยอร์กประเทศสหรัฐอเมริกา/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษา ครั้งที่ 12 ปีการศึกษา 2561  ในวันที 17 สิงหาคม 2560', 2, '2019-09-25 06:07:11', '2019-09-25 06:07:11'),
(32, '1512433003', '20451108', 'นางสาว', 'กุลประภัสสร์', 'ฉันทาลักษณ์', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2016, 2, 2, 'ปัญหาตามกฎหมายของผู้ลงทุนในการระดมทุนผ่านผู้ให้บริการระบบเครือข่ายอิเล็กทรอนิกส์ (Funding Portal) ในการระดมทุนประเภท Equity Crowdfumding ตามหลักเกณฑ์ของสำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษา ครั้งที่ 12 ปีการศึกษา 2561  ในวันที 17 สิงหาคม 2560', 2, '2019-09-25 07:21:24', '2019-09-25 07:21:24'),
(33, '1512433005', '20451108', 'นางสาว', 'นริศสา', 'แสงศิลาวุฒิกุล', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2016, 2, 0, 'กรณีศึกษาเปรียบเทียบหลักเกณฑ์ในการปฏิบัติเกี่ยวกับการรู้จักลูกค้าและการตรวจสอบเพื่อทราบข้อเท็จจริงเกี่ยวกับลูกค้าของประเทศไทยและประเทศสหรัฐอเมริกา (Know Your Customer & Customer Due Diligence : KYC/CDD)/การประชุมผลนำเสนองานวิจัยบัณฑิตศึกษา ครั้งที่ 12 ปีการศึกษา 2561  ในวันที 17 สิงหาคม 2560', 2, '2019-09-25 07:27:26', '2019-09-25 07:27:26'),
(34, '1512433006', '19591108', 'นาย', 'ก้องภพ', 'รามศิริ', 'บัณฑิตวิทยาลัย', 'กลุ่มวิชากฎหมายตลาดทุน', 2016, 2, 0, 'ปัญหาการฟื้นฟูกิจการ กรณีหลักเกณฑ์การยื่นคำร้องขอฟื้นฟูกิจการ/การประชุมผลนำเสนองานวิจัยแห่งบัณฑิตศึกษา ครั้งที่ 12 ปีการศึกษา 2561 ม.รังสิต ในวันที 17 สิงหาคม 2560', 2, '2019-09-25 07:31:01', '2019-09-25 07:31:01'),
(35, '1532393008', '18141102', 'นางสาว', 'พิชญ์สินี', 'ภัทรธีรทิพย์', 'บัณฑิตวิทยาลัย', 'บัญชี', 2018, 1, 0, 'ปัจจัยที่มีผลต่อราคาหลักทรัพย์ของบริษัทจดทะเบียนในตลาดหลักทรัพย์แห่งประเทศไทยในกลุ่มอุตสาหกรรมการเงิน', 2, '2019-09-25 08:13:25', '2019-09-25 08:13:25'),
(36, '1612393002', '18141102', 'นางสาว', 'สุภาพร', 'เขือนอก', 'บัณฑิตวิทยาลัย', 'บัญชี', 2018, 1, 2, 'การศึกษา​ทักษะวิชาชีพ​ที่จำเป็นของนักบัญชี​วิชาชีพอาเซียนในยุคประชาคม​เศรษฐกิจ​อาเซียน', 2, '2019-09-25 08:16:09', '2019-09-25 08:16:09'),
(37, '1612393003', '25561063', 'นาย', 'รชตะ', 'รัตนโชติ', 'บัณฑิตวิทยาลัย', 'บัญชี', 2018, 1, 0, 'ศึกษาปัจจัยที่ส่งผลต่อความพึงพอใจของผู้รับบริการด้านคุณภาพการบริการ กรณีศึกษา สำนักงานบัญชีแห่งหนึ่ง', 2, '2019-09-25 08:17:23', '2019-09-25 08:17:23'),
(38, '1612393008', '25561063', 'นางสาว', 'ชนัญชิดาภรณ์', 'ชำนิกุล', 'บัณฑิตวิทยาลัย', 'บัญชี', 2018, 1, 2, 'ศึกษาการใช้ฟินเทค (Fin Tech) ของบริษัทในเขตกรุงเทพมหานคร', 2, '2019-09-25 08:18:33', '2019-09-25 08:18:33'),
(39, '1632393005', '09261102', 'นางสาว', 'สุพิชญา', 'พรอนันต์จำเริญ', 'บัณฑิตวิทยาลัย', 'บัญชี', 2018, 1, 2, 'ปัจจัยทางด้านโครงสร้างเงินทุนและนโยบายเงินปันผลที่ส่งผลต่อราคาหลักทรัพย์ กรณีศึกษา:บริษัทจดทะเบียนในตลาดหลักทรัพย์แห่งประเทศไทย กลุ่ม SET 100', 2, '2019-09-25 08:21:14', '2019-09-25 08:21:14'),
(40, '1632393006', '18141102', 'นางสาว', 'ปรียานุช', 'ลิ้มดำเนิน', 'บัณฑิตวิทยาลัย', 'บัญชี', 2018, 1, 2, 'ความสัมพันธ์ระหว่างการกำกับดูแลกิจการกับผลการดำเนินงาน ของบริษัทจดทะเบียนในตลาดหลักทรัพย์แห่งประเทศไทย กลุ่ม SET 100', 2, '2019-09-25 08:22:20', '2019-09-25 08:22:20'),
(41, '1632393007', '09261102', 'นางสาว', 'ธันยพร', 'จึงสว่าง', 'บัณฑิตวิทยาลัย', 'บัญชี', 2018, 1, 2, 'การกำกับดูแลกิจการและผลการดำเนินงานที่ส่งผลต่อราคาหลักทรัพย์ : กรณีศึกษาบริษัทจดทะเบียนในตลาดหลักทรัพย์ เอ็ม เอ ไอ', 2, '2019-09-25 08:23:18', '2019-09-25 08:23:18'),
(42, '1632393008', '19461102', 'นาย', 'บุริศร์', 'ทุ่งสุกใส', 'บัณฑิตวิทยาลัย', 'บัญชี', 2018, 1, 2, 'ความสัมพันธ์ระหว่างรายได้ที่ไม่ใช่ดอกเบี้ยกับส่วนต่างของรายได้ดอกเบี้ยสุทธิของธนาคารพาณิชย์ในประเทศไทย', 2, '2019-09-25 08:26:11', '2019-09-25 08:26:11'),
(43, '1720152301001', '14641101', 'นาย', 'พิเชฐ', 'นำพูลสุขสันติ์', 'บัณฑิตวิทยาลัย', 'บริหารธุรกิจดุษฎีบัณฑิต', 2018, 1, 1, 'The role of Emerging organizational capabilities on firm performance in digital era : dynamic capability approach', 1, '2019-09-25 08:36:08', '2019-09-25 08:38:26'),
(44, '1720152301002', '18721101', 'นางสาว', 'ฐานิสา', 'ศิริถาพร', 'บัณฑิตวิทยาลัย', 'บริหารธุรกิจดุษฎีบัณฑิต', 2018, 1, 1, 'Social Innovation in Thailand', 1, '2019-09-25 08:36:50', '2019-09-25 08:36:50'),
(45, '1720152301003', '13701101', 'นาย', 'สิทธพงษ์', 'เลี่ยมสุวรรณ', 'บัณฑิตวิทยาลัย', 'บริหารธุรกิจดุษฎีบัณฑิต', 2018, 1, 1, 'Identifying Approaches that Impact Digital Business Model Innovation and  Company Performance in Thai Pharmaceutical Industry', 1, '2019-09-25 08:38:01', '2019-09-25 08:38:01'),
(46, '1613023001', '''01611106', 'นาย', 'จิรภัทร', 'เริ่มศรี', 'บัณฑิตวิทยาลัย', 'นิเทศศาสตรดุษฎีบัณฑิต', 2017, 2, 1, 'การสื่อสารอัตลักษณ์เพื่อสร้างความแข็งแกร่งตราสินค้าผ้าย้อมครามตามแนวคิดเศรษฐกิจสร้างสรรค์ / Identity Communication to build Stong Brand of indigo fabries Using Creative Idea', 1, '2019-09-25 09:20:40', '2019-09-25 09:20:40'),
(47, '1613023011', '''01611106', 'นาย', 'ธิติพัทธ์', 'ลิ้มสัมฤทธิ์นิภา', 'บัณฑิตวิทยาลัย', 'นิเทศศาสตรดุษฎีบัณฑิต', 2017, 2, 1, 'การพัฒนารูปแบบการสื่อสารเพื่อสร้างตราองค์กรของสถาบันอุดมศึกษาตามแนวคิดพันธกิจสัมพันธ์ / Developing of Communication Model to Build Brand Equity of The Higher Education Institution base on Social Engagement Concept', 1, '2019-09-25 09:33:36', '2019-09-25 09:33:36');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_lecturers`
--

CREATE TABLE IF NOT EXISTS `tbl_lecturers` (
  `id` int(10) unsigned NOT NULL,
  `lec_id` char(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `personal_id` char(13) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `user_name` char(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lec_title1` char(13) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lec_title2` char(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lec_fname` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lec_lname` char(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `academic_name` char(50) COLLATE utf8mb4_unicode_ci DEFAULT 'NULL' COMMENT 'ตำแหน่งทางวิชาการ',
  `abbreviation` char(10) COLLATE utf8mb4_unicode_ci DEFAULT 'NULL',
  `major` char(100) COLLATE utf8mb4_unicode_ci DEFAULT 'NULL',
  `image` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT 'NULL',
  `status` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=56 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tbl_lecturers`
--

INSERT INTO `tbl_lecturers` (`id`, `lec_id`, `personal_id`, `user_name`, `lec_title1`, `lec_title2`, `lec_fname`, `lec_lname`, `academic_name`, `abbreviation`, `major`, `image`, `status`, `created_at`, `updated_at`) VALUES
(3, '00771101', '3101201250131', NULL, 'นาง', 'ผู้ช่วยศาสตราจารย์', 'อัจฉราพรรณ', 'ลีฬพันธ์', 'ผู้ช่วยศาสตราจารย์', 'พณ.ม.', 'การตลาด', NULL, 1, NULL, NULL),
(4, '00811101', '3102001615195', NULL, 'นาง', 'ผู้ช่วยศาสตราจารย์', 'สุดา', 'ปีตะวรรณ', 'ผู้ช่วยศาสตราจารย์', 'พณ.ม.', 'การจัดการทั่วไป', NULL, 1, NULL, NULL),
(9, '00881102', NULL, NULL, 'นาง', 'ผู้ช่วยศาสตราจารย์', 'อิสรีย์', 'โชว์วิวัฒนา', 'ผู้ช่วยศาสตราจารย์', 'บธ.ม.', 'การบัญชี', NULL, 1, '2019-07-09 07:46:59', '2019-07-09 07:46:59'),
(10, '01041102', NULL, 'somjai_cha', 'นาง', 'ผู้ช่วยศาสตราจารย์', 'สมใจ', 'จันทร์เต็ม', 'ผู้ช่วยศาสตราจารย์', 'บช.ม.', 'การบัญชี', NULL, 1, '2019-07-09 07:50:31', '2019-07-09 07:50:31'),
(17, '01061105', NULL, NULL, 'นาง', 'ผู้ช่วยศาสตราจารย์', 'วัจนาภรณ์', 'จิตตมาศ', 'ผู้ช่วยศาสตราจารย์', 'พบ.ม.', 'สถิติประยุกต์', NULL, 1, '2019-07-10 07:43:33', '2019-07-10 07:43:33'),
(22, '01091102', '3102101396835', 'angsana_sri', 'นางสาว', 'ผู้ช่วยศาสตราจารย์', 'อังสนา', 'ศรีประเสริฐ', 'ผู้ช่วยศาสตราจารย์', 'M.B.A.', 'General', 'nophoto.jpg', 1, '2019-07-12 06:15:50', '2019-07-12 06:15:50'),
(23, '01101102', NULL, NULL, 'นางสาว', 'ผู้ช่วยศาสตราจารย์', 'ดุษฎี', 'ศิริวัฒนพงษ์', 'ผู้ช่วยศาสตราจารย์', 'บช.ม.', 'การบัญชี', 'nophoto.jpg', 1, '2019-07-12 06:32:01', '2019-07-12 06:32:01'),
(24, '18771104', '3929900084990', 'sirinya_chi', 'นาง', 'อาจารย์', 'สิรินยา', 'จิระสวัสดิ์', 'อาจารย์', 'ค.ม.', 'อุดมศึกษา', 'nophoto.jpg', 1, '2019-07-12 06:45:19', '2019-07-12 06:45:19'),
(25, '25581036', '5101599032091', 'sarayuddha_lha', 'นาย', 'อาจารย์', 'สรายุทธ', 'เลิศปัจฉิมนันท์', 'อาจารย์', 'พศ.ม.', 'บุคลาการ', 'nophoto.jpg', 1, '2019-07-12 06:48:48', '2019-07-12 06:48:48'),
(26, '01301102', '3101800783748', 'niyada_vis', 'นางสาว', 'ผู้ช่วยศาสตราจารย์', 'นิยะดา', 'วิเศษบริสุทธิ์', 'ผู้ช่วยศาสตราจารย์', 'บช.ม.', 'การบัญชีทั่วไป', 'nophoto.jpg', 1, '2019-07-12 06:52:22', '2019-07-12 06:52:22'),
(30, '01331105', '3101403158588', 'wallop_cha', 'นาย', 'ผู้ช่วยศาสตราจารย์', 'วัลลภ', 'เฉลิมสุวิวัฒนาการ', 'ผู้ช่วยศาสตราจารย์', 'พบ.ม.', 'สถิติประยุกต์', 'nophoto.jpg', 1, '2019-07-24 02:51:14', '2019-07-24 03:21:37'),
(31, '01551101', '3100502719480', NULL, 'นางสาว', 'ผู้ช่วยศาสตราจารย์', 'เสาวนิตย์', 'จันทนโรจน์', 'ผู้ช่วยศาสตราจารย์', 'M.B.A.', 'Industrial Management', 'nophoto.jpg', 1, '2019-07-24 03:24:08', '2019-07-25 08:54:21'),
(37, '03201103', '3720200758461', NULL, NULL, 'ผู้ช่วยศาสตราจารย์ ดร.', 'จิราภรณ์', 'ชาวงษ์', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 0, '2019-09-17 09:43:52', '2019-09-24 07:21:35'),
(39, '03201103', '3720200758461', NULL, NULL, 'ผู้ช่วยศาสตราจารย์', 'ดร.จิราภรณ์', 'ชาวงษ์', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 07:07:46', '2019-09-24 07:21:26'),
(40, '02231103', '3102001418403', NULL, NULL, 'ผู้ช่วยศาสตราจารย์', 'ดร.คมกริช', 'ถาวรวันชัย', 'รองศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 07:10:53', '2019-09-24 07:21:04'),
(41, '18471103', '3100601337321', NULL, NULL, 'ผู้ช่วยศาสตราจารย์', 'ดร.ลลิตา', 'จันทรวงศ์ไพศาล', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 07:18:20', '2019-09-24 07:20:39'),
(42, '10551103', '3100502478857', NULL, NULL, 'ศาสตราจารย์', 'ดร.ภูมิฐาน', 'รังคกูลนุวัฒน์', 'ศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 07:23:01', '2019-09-24 07:23:01'),
(43, '20441108', '3100800194032', NULL, 'นางสาว', 'ผู้ช่วยศาสตราจารย์', 'ดร.วีณา', 'อนุสรณ์เสนา', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 07:54:39', '2019-09-24 07:56:51'),
(44, '19591108', '3100901795121', NULL, 'นางสาว', 'ผู้ช่วยศาสตราจารย์', 'ดร.ศิริญญา', 'ดุสิตนานนท์', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 07:59:29', '2019-09-24 07:59:50'),
(45, '20451108', '3100500420690', NULL, NULL, 'ผู้ช่วยศาสตราจารย์', 'ดร.ณัฐริกา', 'แชน', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 08:04:40', '2019-09-24 08:04:40'),
(46, '19051108', '3620400385774', NULL, 'นาย', 'ผู้ช่วยศาสตราจารย์', 'ดร.ประพันธ์พงษ์', 'ขำอ่อน', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 08:11:15', '2019-09-24 08:11:36'),
(47, '12731101', '3760100412261', NULL, NULL, 'อาจารย์\r\n', 'ดร.สิริพันธ์', 'ดีศีลธรรม', 'อาจารย์\r\n', NULL, NULL, 'nophoto.jpg', 1, '2019-09-24 09:53:28', '2019-09-24 09:53:49'),
(48, '18141102', '3100503417916', NULL, 'นางสาว', 'ผู้ช่วยศาสตราจารย์', 'ดร.สันนุดี', 'เสลารัตน์', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-25 07:42:36', '2019-09-25 07:42:36'),
(49, '25561063', '3101701040542', NULL, 'นางสาว', 'อาจารย์', 'ดร.ศิริพรรณ', 'เขื่อนข่ายแก้ว', 'อาจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-25 08:01:08', '2019-09-25 08:01:23'),
(50, '09261102', '3100800051151', NULL, 'นางสาว', 'รองศาสตราจารย์', 'ดร.กิตติมา', 'อัครนุพงศ์', 'รองศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-25 08:04:10', '2019-09-25 08:04:10'),
(51, '19461102', '3610500033136', NULL, 'นางสาว', 'อาจารย์', 'ดร.สุตาภัทร', 'ทิพย์รังศรี', 'อาจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-25 08:11:07', '2019-09-25 08:11:07'),
(52, '14641101', '3100902209730', NULL, 'นาย', 'อาจารย์', 'ดร.ภูษิต', 'วงศ์หล่อสายชล', 'อาจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-25 08:32:35', '2019-09-25 08:32:35'),
(53, '18721101', '3100502938777', NULL, 'นาย', 'ผู้ช่วยศาสตราจารย์', 'ดร.ณัฐพันธ์', 'บัววราภรณ์', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-25 08:34:08', '2019-09-25 08:34:08'),
(54, '13701101', '3101202750889', NULL, NULL, 'ผู้ช่วยศาสตราจารย์', 'ดร.โรจนศักดิ์', 'โฉมวิไลลักษณ์', 'ผู้ช่วยศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-25 08:35:07', '2019-09-25 08:35:07'),
(55, '''01611106', '3102400733949', NULL, 'นาง', 'รองศาสตราจารย์', 'ดร.จันทิมา', 'เขียวแก้ว', 'รองศาสตราจารย์', NULL, NULL, 'nophoto.jpg', 1, '2019-09-25 09:13:48', '2019-09-25 09:14:29');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(10) unsigned NOT NULL,
  `name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `student_id` (`student_id`);

--
-- Indexes for table `tbl_lecturers`
--
ALTER TABLE `tbl_lecturers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `students`
--
ALTER TABLE `students`
  MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=48;
--
-- AUTO_INCREMENT for table `tbl_lecturers`
--
ALTER TABLE `tbl_lecturers`
  MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=56;
--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
